In [1]:
import pandas as pd

In [3]:
tup_data = ('이름임', '2022-11-08', 100, True)
sr = pd.Series(tup_data, index=['이름', '날짜', '숫자', '부울'])

In [4]:
print(sr)

이름           이름임
날짜    2022-11-08
숫자           100
부울          True
dtype: object

인덱싱

In [5]:
sr['이름']

'이름임'

In [6]:
sr[0]

'이름임'

In [7]:
sr[['이름', '숫자']]

이름    이름임
숫자    100
dtype: object

슬라이싱
- 숫자형 인덱스로 슬리이싱하면 끝은 포함 X
- 문자열 인덱스로 슬라이싱하면 끝도 포함 O

In [12]:
sr[0:2] # 2는 포함되지 않음

이름           이름임
날짜    2022-11-08
dtype: object

In [13]:
sr['날짜':'숫자'] # 숫자도 포함

날짜    2022-11-08
숫자           100
dtype: object

# 데이터 프레임

DataFrame은 Serieses의 집합

데이터프레임을 생성하기 위해 여러 시리즈 필요\
여러 시리즈 = 여러 열

인덱스 이름과 열 이름 직접 지정\
딕셔너리로 데이터프레임을 생성할 경우 키가 열 이름, 값이 각각 데이터에 위치\
직접 데이터프레임을 만들 경우 리스트가 그대로 행의 자리로 들어감

In [14]:
df = pd.DataFrame([[22, '남', '인천대'], [24, '여', '부산대']], index=['규석', '다미'], columns=['나이', '성별', '대학'])

In [15]:
df

    나이 성별   대학
규석  22  남  인천대
다미  24  여  부산대

In [16]:
df.index, df.columns

(Index(['규석', '다미'], dtype='object'),
 Index(['나이', '성별', '대학'], dtype='object'))

행 인덱스와 열 이름 변경

In [17]:
df = pd.DataFrame([[22, '남', '인천대'], [24, '여', '부산대']], index=['규석', '다미'], columns=['나이', '성별', '대학'])

In [19]:
df.rename(index={'규석':'학생1', '다미':'학생2'}, inplace=True)
df.rename(columns={'나이':'연령', '성별':'남여', '대학':'학교'}, inplace=True)

In [20]:
df

     연령 남여   학교
학생1  22  남  인천대
학생2  24  여  부산대

행 제거, 열 제거

In [25]:
dic = {'국어' : [90, 80, 70], '수학':[75, 85, 85],  '영어':[95, 100, 95]}

In [26]:
df= pd.DataFrame(dic, index=['학생1', '학생2', '학생3'])

In [30]:
df2 = df.copy()
df3 = df.copy()

drop()함수

In [34]:
df2.drop('학생3', inplace=True)

In [38]:
df2

     국어  수학   영어
학생1  90  75   95
학생2  80  85  100

In [41]:
df3.drop(columns='국어')

     수학   영어
학생1  75   95
학생2  85  100
학생3  85   95

TypeError: 'Index' object is not callable

In [61]:
exam_data = {
    '이름': ['학생1', '학생2', '학생3', '학생4', '학생5'],
    '국어': [90, 80, 70, 60, 50],
    '수학': [75, 85,85, 90, 100],
    '영어': [95, 100, 95, 90, 90]
}
exam_data2 = {
    '국어': [90, 80, 70, 60, 50],
    '수학': [75, 85,85, 90, 100],
    '영어': [95, 100, 95, 90, 90]
}
df = pd.DataFrame(exam_data)
df2 = pd.DataFrame(exam_data2, index=['학생1', '학생2', '학생3', '학생4', '학생5'])

단일 원소 선택

In [66]:
# 기준행 잡기
df.set_index('이름', inplace=True)
df2.set_index('국어', inplace=True)

In [67]:
df

     국어   수학   영어
이름
학생1  90   75   95
학생2  80   85  100
학생3  70   85   95
학생4  60   90   90
학생5  50  100   90

In [68]:
df2

     수학   영어
국어
90   75   95
80   85  100
70   85   95
60   90   90
50  100   90